; domain
(define (domain puerto)
	(:requirements :typing)
	(:types muelle contenedor grua pila cinta altura -object)
	
	(:predicates (in  ?p - (either pila grua cinta) ?m - muelle) ; control
				 (notCinta  ?ct - cinta ?m - muelle)
				 (at  ?c - contenedor ?x - (either pila cinta)) ; esta en
				 (top ?c - (either pila contenedor) ?m - muelle) ; esta arriba del todo
				 (on ?c - contenedor ?p - (either pila contenedor)) ; encima de
				 (ocupada ?ct - cinta)
				 (not_ocupada ?ct - cinta)
				 (vacia ?g - grua)
				 (holding ?g - grua ?c - contenedor)
				 (disponible ?c - contenedor)
				 (isgoal ?c - contenedor)
				 (altura_pila ?p - pila ?n - altura)
				 (next ?alt -altura ?sigalt - altura)
	)
				 
	(:action coger
        :parameters (?base - (either pila contenedor) ?c - contenedor ?p1 - pila ?m - muelle ?g - grua  ?antalt - altura ?alt - altura )
        :precondition (and 
						(in ?p1 ?m) ;Si las pilas estan en el mismo muelle
						(in ?g ?m) ;Si la grua estan en el mismo muelle
						(top ?c ?m) ;Si el  contenedor esta en el tope de la pila de origen
						(on ?c ?base) ; seleccionamos lo que hay debajo para cambiar despues
						(vacia ?g) ; grua esta libre
						(altura_pila ?p1 ?alt) ;comprobamos la altura
						(next ?antalt ?alt)  ; comprobamos el maximo de la pila
					)
        :effect ( and   
					   (not(vacia ?g))
					   (not(top ?c ?m))
					   (not(on ?c ?base))
					   (not (at ?c ?p1))
					   (top ?base ?m)
					   (holding ?g ?c)
					   (altura_pila ?p1 ?antalt)
				)
	)
	
	(:action soltar
        :parameters (?base - (either pila contenedor) ?c - contenedor ?p1 - pila ?m - muelle ?g - grua ?alt - altura ?sigalt - altura)
        :precondition (and 
						(in ?p1 ?m) ;Si las pilas estan en el mismo muelle
						(in ?g ?m) ;Si las pilas estan en el mismo muelle
						(top ?base ?m) ; escogemos el contenedr dell top
						(holding ?g ?c) ; grua tiene c
						(altura_pila ?p1 ?alt) ;comprobamos la altura
						(next ?alt ?sigalt)  ; comprobamos el maximo de la pila
					)
        :effect ( and   
					   (vacia ?g)
					   (not (holding ?g ?c))
					   (at ?c ?p1)
					   (top ?c ?m)
					   (on ?c ?base)
					   (not (top ?base ?m))
					   (altura_pila ?p1 ?sigalt)
				)
	)
	
	(:action solta_especial
        :parameters (?base - contenedor ?c - contenedor ?p1 - pila ?m - muelle ?g - grua ?alt - altura ?sigalt - altura)
        :precondition (and 
						(in ?p1 ?m) ;Si las pilas estan en el mismo muelle
						(in ?g ?m) ;Si las pilas estan en el mismo muelle
						(isgoal ?c) ; si la base es goal
						(isgoal ?base) ; si la base es goal
						(top ?base ?m) ; escogemos el contenedr dell top
						(holding ?g ?c) ; grua tiene c
						(altura_pila ?p1 ?alt) ;comprobamos la altura
						(next ?alt ?sigalt)  ; comprobamos el maximo de la pila
					)
        :effect ( and   
					   (vacia ?g)
					   (not (holding ?g ?c))
					   (at ?c ?p1)
					   (top ?c ?m)
					   (on ?c ?base)
				)
	)
	
	(:action coger_desde_cinta
        :parameters (?c - contenedor ?ct - cinta ?m - muelle ?g - grua)
        :precondition (and
						(in ?g ?m) ; La grua esta en el mismo muelle
						(at ?c ?ct) ; el contenedor esta en la cinta
						(notCinta ?ct ?m) ; y no es la cinta de tu muelle
						(vacia ?g)
					)
        :effect ( and  
						(not(vacia ?g))
						(not_ocupada ?ct) ; la cinta pasa a estar no ocupada
						(holding ?g ?c)
						(not(at ?c ?ct)) ; El contenedor ya no esta en la cinta
				)
	)
	
	(:action mover_a_cinta
        :parameters (?c - contenedor ?ct - cinta ?m - muelle ?g - grua)
        :precondition (and 
						(in ?ct ?m) ; Si el muelle y la cinta se corresponden
						(in ?g ?m) ; La grua esta en el mismo muelle
						(not_ocupada ?ct) ; la cinta no esta ocupada
						(holding ?g ?c) ; grua tiene c
					)
        :effect (and
					(at ?c ?ct) ; el contenedor pasa a estar en la cinta
					(ocupada ?ct) ; la cinta pasa a estar ocupada
					(not(holding ?g ?c))
					(vacia ?g)
				)
	)
		
        
)

; problem
(define (problem puerto)
	(:domain puerto)
	(:objects
		m1 m2 - muelle
		ct1 ct2 - cinta
		g1 g2 - grua
		p11 p12 p21 p22 - pila
		c1 c2 c3 c4 c5 - contenedor
		n2 n1 n0 - altura
)
	(:init
	
		(not_ocupada ct1)
		(not_ocupada ct2)	
		(notCinta ct2 m1)	
		(notCinta ct1 m2)
		; pilas gruas y cintas en muelles
		(in ct1 m1)
		(in g1 m1)
		(in p11 m1)
		(in p12 m1)
		(vacia g1)
		
		(in ct2 m2)
		(in g2 m2)
		(in p21 m2)
		(in p22 m2)
		(vacia g2)

		(next n0 n1)
		(next n1 n2)
		
		; contenedores en las pilas
		; ------ muelle 1

		; ______ pila 1
		(at c4 p11)
		(at c5 p11)
		
		(on c4 p11)
		(on c5 c4)
		(top c5 m1)
		(altura_pila p11 n2)
		
		; ______ pila 2
		
		(top p12 m1)
		(altura_pila p12 n0)
		
		; ------ muelle 2

		; ______ pila 1
		(at c1 p21)
		(on c1 p21)

		(top c1 m2)
		(altura_pila p21 n1)
		
		; ______ pila 2
		(at c2 p22)
		(at c3 p22)
	
		(on c3 p22)
		(on c2 c3)
		(top c2 m2)
		(altura_pila p22 n2)

		

		; Goals		
		(isgoal c3)
		(isgoal c4)	
		(isgoal c1)	
	)
	
	(:goal 
		(and 
			(top c4 m1)
			(top c1 m1)
			(top c3 m1)
		)
	)
)

; plan
1. (coger c3 c2 p22 m2 g2 n1 n2)
   deleted: (vacia g2) (top c2 m2) (on c2 c3) (at c2 p22)
   added: (top c3 m2) (holding g2 c2) (altura_pila p22 n1)
   goals met: 0 of 3
2. (mover_a_cinta c2 ct2 m2 g2)
   deleted: (holding g2 c2)
   added: (at c2 ct2) (ocupada ct2) (vacia g2)
   goals met: 0 of 3
3. (coger p22 c3 p22 m2 g2 n0 n1)
   deleted: (vacia g2) (top c3 m2) (on c3 p22) (at c3 p22)
   added: (top p22 m2) (holding g2 c3) (altura_pila p22 n0)
   goals met: 0 of 3
4. (mover_a_cinta c3 ct2 m2 g2)
   deleted: (holding g2 c3)
   added: (at c3 ct2) (vacia g2)
   goals met: 0 of 3
5. (coger_desde_cinta c3 ct2 m1 g1)
   deleted: (vacia g1) (at c3 ct2)
   added: (holding g1 c3)
   goals met: 0 of 3
6. (coger p21 c1 p21 m2 g2 n0 n1)
   deleted: (vacia g2) (top c1 m2) (on c1 p21) (at c1 p21)
   added: (top p21 m2) (holding g2 c1) (altura_pila p21 n0)
   goals met: 0 of 3
7. (soltar p12 c3 p12 m1 g1 n0 n1)
   deleted: (holding g1 c3) (top p12 m1)
   added: (vacia g1) (at c3 p12) (top c3 m1) (on c3 p12) (altura_pila p12 n1)
   goals met: 1 of 3
8. (mover_a_cinta c1 ct2 m2 g2)
   deleted: (holding g2 c1)
   added: (at c1 ct2) (vacia g2)
   goals met: 1 of 3
9. (coger_desde_cinta c1 ct2 m1 g1)
   deleted: (vacia g1) (at c1 ct2)
   added: (holding g1 c1)
   goals met: 1 of 3
10. (solta_especial c3 c1 p12 m1 g1 n1 n2)
   deleted: (holding g1 c1)
   added: (vacia g1) (at c1 p12) (top c1 m1) (on c1 c3)
   goals met: 2 of 3
11. (coger c4 c5 p11 m1 g1 n1 n2)
   deleted: (vacia g1) (top c5 m1) (on c5 c4) (at c5 p11)
   added: (top c4 m1) (holding g1 c5) (altura_pila p11 n1)
   goals met: 3 of 3
